{"config": [{"config": {"name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape": null, "trainable": true, "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 24, "subsample": [2, 2], "W_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 36, "subsample": [2, 2], "W_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 48, "subsample": [2, 2], "W_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "border_mode": "valid", "W_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 100, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 1152, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 50, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 100, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 10, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 50, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_8", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activation": "linear", "bias": true, "W_regularizer": null, "trainable": true, "output_dim": 1, "W_constraint": null, "name": "dense_4", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": 10, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}